{
  "metadata": {
    "total_size": 13481033728
  },
  "weight_map": {
    "lm_head.weight": "pytorch_model-00002-of-00002.bin",
    "model.embed_tokens.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.1.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.10.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.11.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.12.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.13.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.14.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.15.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.16.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.17.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.18.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.19.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.2.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.20.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00002.bin",
    "model.layers.21.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_down.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_gate.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.0": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.1": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.2": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.3": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.4": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.5": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.6": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.calculator.experts.weight_up.7": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.gate.gate_network.0.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.gate.gate_network.2.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.22.mlp.gate.weight_noise.weight": "pytorch_model-00001-of-00002.bin",
